In [2]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/uber

In [2]:
%%sql

show databases;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
7 rows affected.

[('de_project',),
 ('information_schema',),
 ('mydb',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('uber',)]

In [5]:
%%sql

create database de_project;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[]

In [6]:
%%sql
use de_project;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [14]:
%%sql

create table test (sno int , name varchar(100))

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [18]:
%%sql
select * from test;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
2 rows affected.

[(1, 'gowtham'), (2, 'nandhini')]

In [17]:
%%sql
insert into test (sno,name) values (2,"nandhini");

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[]

In [23]:
%%sql
update test set name='sbgowtham' , sno=3 where sno=1;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[]

In [28]:
%%sql
select * from test;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [25]:
%%sql
delete from test where sno=3

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[]

In [27]:
%%sql

truncate table test;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [29]:
%%sql

drop table test;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [30]:
%%sql
create table employees (employee_id INT PRIMARY KEY,
first_name VARCHAR(50) NOT NULL, last_name VARCHAR(50) NOT NULL, hire_date DATE NOT NULL, salary DECIMAL(10,2));

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [31]:
%%sql
#CTAS

create table high_paid_employees as SELECT employee_id,first_name,last_name,salary from employees where salary > 60000;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [ ]:
%%sql
show tables;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
2 rows affected.
0 rows affected.

[]

In [36]:
%%sql

drop table temp_high_paid_employees;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [37]:
%%sql
create temporary table temp_high_paid_employees ( employee_id INT , salary DECIMAL(10,2));
insert into temp_high_paid_employees select employee_id, salary from employees where salary > 60000;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [49]:
%%sql
drop table if exists employees;
create table employees (EmployeeID INT PRIMARY KEY, FirstName varchar(50), LastName varchar(50))

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [50]:
%%sql
describe employees;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
3 rows affected.

[('EmployeeID', 'int', 'NO', 'PRI', None, ''),
 ('FirstName', 'varchar(50)', 'YES', '', None, ''),
 ('LastName', 'varchar(50)', 'YES', '', None, '')]

In [52]:
%%sql
alter table employees add email varchar(100);

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [53]:
%%sql
describe employees

 * mysql+mysqlconnector://blackbasil:***@localhost/test
4 rows affected.

[('EmployeeID', 'int', 'NO', 'PRI', None, ''),
 ('FirstName', 'varchar(50)', 'YES', '', None, ''),
 ('LastName', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [54]:
%%sql
alter table employees drop column LastName;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [55]:
%%sql
describe employees

 * mysql+mysqlconnector://blackbasil:***@localhost/test
3 rows affected.

[('EmployeeID', 'int', 'NO', 'PRI', None, ''),
 ('FirstName', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [56]:
%%sql
alter table employees rename to emp_123

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [58]:
%%sql
desc emp_123

 * mysql+mysqlconnector://blackbasil:***@localhost/test
3 rows affected.

[('EmployeeID', 'int', 'NO', 'PRI', None, ''),
 ('FirstName', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [ ]:
%%sql
create database uber;
use uber;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.
1 rows affected.
0 rows affected.

[]

In [62]:
%%sql
create table rides(
    ride_id INT PRIMARY KEY,
    driver_id INT,
    rider_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10,2)
);

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [63]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES 
(1, 101, 201, 'MG Road, Bangalore', 'Indiranagar, Bangalore', '2025-06-20 08:30:00', 220.50),
(2, 102, 202, 'T Nagar, Chennai', 'Velachery, Chennai', '2025-06-20 09:15:00', 180.00),
(3, 103, 203, 'Kondapur, Hyderabad', 'Gachibowli, Hyderabad', '2025-06-19 18:45:00', 150.75),
(4, 104, 204, 'Baner, Pune', 'Hinjewadi, Pune', '2025-06-21 11:00:00', 250.00),
(5, 105, 205, 'Salt Lake, Kolkata', 'Park Street, Kolkata', '2025-06-21 14:20:00', 300.40);

 * mysql+mysqlconnector://blackbasil:***@localhost/test
5 rows affected.

[]

In [64]:
%%sql 
select * from rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
5 rows affected.

[(1, 101, 201, 'MG Road, Bangalore', 'Indiranagar, Bangalore', datetime.datetime(2025, 6, 20, 8, 30), Decimal('220.50')),
 (2, 102, 202, 'T Nagar, Chennai', 'Velachery, Chennai', datetime.datetime(2025, 6, 20, 9, 15), Decimal('180.00')),
 (3, 103, 203, 'Kondapur, Hyderabad', 'Gachibowli, Hyderabad', datetime.datetime(2025, 6, 19, 18, 45), Decimal('150.75')),
 (4, 104, 204, 'Baner, Pune', 'Hinjewadi, Pune', datetime.datetime(2025, 6, 21, 11, 0), Decimal('250.00')),
 (5, 105, 205, 'Salt Lake, Kolkata', 'Park Street, Kolkata', datetime.datetime(2025, 6, 21, 14, 20), Decimal('300.40'))]

In [70]:
%%sql
select * from rides where fare > 200 order by fare desc;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
3 rows affected.

[(5, 105, 205, 'Salt Lake, Kolkata', 'Park Street, Kolkata', datetime.datetime(2025, 6, 21, 14, 20), Decimal('300.40')),
 (4, 104, 204, 'Baner, Pune', 'Hinjewadi, Pune', datetime.datetime(2025, 6, 21, 11, 0), Decimal('250.00')),
 (1, 101, 201, 'MG Road, Bangalore', 'Indiranagar, Bangalore', datetime.datetime(2025, 6, 20, 8, 30), Decimal('220.50'))]

In [67]:
%%sql
desc rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [82]:
%%sql
create table rides(
    ride_id INT,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME  NOT NULL,
    fare DECIMAL(10,2) NOT NULL,
    primary key(ride_id,rider_id)
)

 * mysql+mysqlconnector://blackbasil:***@localhost/test
0 rows affected.

[]

In [83]:
%%sql  
desc rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [84]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES 
(1, 101, 201, 'MG Road, Bangalore', 'Indiranagar, Bangalore', '2025-06-20 08:30:00', 220.50)

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[]

In [86]:
%%sql
select * from rides

 * mysql+mysqlconnector://blackbasil:***@localhost/test
1 rows affected.

[(1, 101, 201, 'MG Road, Bangalore', 'Indiranagar, Bangalore', datetime.datetime(2025, 6, 20, 8, 30), Decimal('220.50'))]

In [4]:
%%sql

create table users(
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]

In [ ]:
%%sql

INSERT INTO users (user_id, email) VALUES(1,'user1@example.com')``

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[]

In [8]:
%%sql

INSERT INTO users (user_id, email) VALUES(2,'user2@example.com')

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[]

In [10]:
%%sql
INSERT INTO users (user_id,email) VALUES(3,null);

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '3' for key 'users.PRIMARY'
[SQL: INSERT INTO users (user_id,email) VALUES(3,null);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [6]:
%%sql
select * from users;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
4 rows affected.

[(3, None),
 (1, 'user1@example.com'),
 (2, 'user2@example.com'),
 (4, 'user4@example.com')]

In [5]:
%%sql
insert into users (user_id,email) values (4,"user4@example.com");

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[]

In [3]:
%%sql
drop table rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]

In [4]:
%%sql
create table rides ( ride_id INT PRIMARY KEY, driver_id INT NOT NULL, rider_id INT, pickup_location VARCHAR(100) NOT NULL,
dropoff_location VARCHAR(100) NOT NULL, ride_date DATETIME NOT NULL, fare DECIMAL(10,2) NOT NULL );

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]

In [5]:
%%sql
desc rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [13]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (1, 101, NULL,'SARUR',' Bangalore', '2025-06-20 08:30:00', 220.50)

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[]

In [14]:
%%sql
select * from rides;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(1, 101, None, 'SARUR', ' Bangalore', datetime.datetime(2025, 6, 20, 8, 30), Decimal('220.50'))]

In [16]:
%%sql
drop table rides;
create table rides ( ride_id INT PRIMARY KEY, driver_id INT NOT NULL, rider_id INT, pickup_location VARCHAR(100) NOT NULL,
dropoff_location VARCHAR(100) NOT NULL, ride_date DATETIME NOT NULL, fare DECIMAL(10,2) CHECK (fare>0) );

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.
0 rows affected.

[]

In [18]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (2, 102, NULL,'KARUR',' Bangalore', '2025-06-20 08:30:00', -220.50)

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
(mysql.connector.errors.DatabaseError) 3819 (HY000): Check constraint 'rides_chk_1' is violated.
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES (2, 102, NULL,'KARUR',' Bangalore', '2025-06-20 08:30:00', -220.50)]
(Background on this error at: https://sqlalche.me/e/20/4xp6)